MikroElektronika/core_packages/ARM/gcc_clang/def/sam/SAMG51N18A/mcu.h
/*
 * \brief CMSIS includes
 */
#include <core_cm4.h>
#if !defined DONT_USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
// #include "system_samg51.h"
#endif /* DONT_USE_CMSIS_INIT */

/** @}  end of SAMG51N18_cmsis CMSIS Definitions */

/** \defgroup SAMG51N18_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAMG51N18 */
/* ************************************************************************** */
#include "component/adc.h"
#include "component/chipid.h"
#include "component/efc.h"
#include "component/gpbr.h"
#include "component/matrix.h"
#include "component/mem2mem.h"
#include "component/pdc.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/spi.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/twi.h"
#include "component/twihs.h"
#include "component/uart.h"
#include "component/usart.h"
#include "component/wdt.h"
/** @}  end of Peripheral Software API */

/** \defgroup SAMG51N18_reg Registers Access Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER ACCESS DEFINITIONS FOR SAMG51N18 */
/* ************************************************************************** */
#include "instance/adc.h"
#include "instance/chipid.h"
#include "instance/efc.h"
#include "instance/gpbr.h"
#include "instance/matrix.h"
#include "instance/mem2mem.h"
#include "instance/pioa.h"
#include "instance/piob.h"
#include "instance/pmc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/rtt.h"
#include "instance/spi.h"
#include "instance/supc.h"
#include "instance/tc0.h"
#include "instance/twi1.h"
#include "instance/twi2.h"
#include "instance/twi0.h"
#include "instance/uart0.h"
#include "instance/uart1.h"
#include "instance/usart.h"
#include "instance/wdt.h"
/** @}  end of Registers Access Definitions */

/** \addtogroup SAMG51N18_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAMG51N18 */
/* ************************************************************************** */
#define ID_SUPC         (  0) /**< \brief Supply Controller (SUPC) */
#define ID_RSTC         (  1) /**< \brief Reset Controller (RSTC) */
#define ID_RTC          (  2) /**< \brief Real-time Clock (RTC) */
#define ID_RTT          (  3) /**< \brief Real-time Timer (RTT) */
#define ID_WDT          (  4) /**< \brief Watchdog Timer (WDT) */
#define ID_PMC          (  5) /**< \brief Power Management Controller (PMC) */
#define ID_EFC          (  6) /**< \brief Embedded Flash Controller (EFC) */
#define ID_UART0        (  8) /**< \brief Universal Asynchronous Receiver Transmitter (UART0) */
#define ID_UART1        (  9) /**< \brief Universal Asynchronous Receiver Transmitter (UART1) */
#define ID_PIOA         ( 11) /**< \brief Parallel Input/Output Controller (PIOA) */
#define ID_PIOB         ( 12) /**< \brief Parallel Input/Output Controller (PIOB) */
#define ID_USART        ( 14) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART) */
#define ID_MEM2MEM      ( 15) /**< \brief Memory to Memory (MEM2MEM) */
#define ID_TWI0         ( 19) /**< \brief Two-wire Interface High Speed (TWI0) */
#define ID_TWI1         ( 20) /**< \brief Two-wire Interface (TWI1) */
#define ID_SPI          ( 21) /**< \brief Serial Peripheral Interface (SPI) */
#define ID_TWI2         ( 22) /**< \brief Two-wire Interface (TWI2) */
#define ID_TC0_CHANNEL0 ( 23) /**< \brief Timer Counter (TC0_CHANNEL0) */
#define ID_TC0_CHANNEL1 ( 24) /**< \brief Timer Counter (TC0_CHANNEL1) */
#define ID_TC0_CHANNEL2 ( 25) /**< \brief Timer Counter (TC0_CHANNEL2) */
#define ID_ADC          ( 29) /**< \brief Analog-to-Digital Converter (ADC) */

#define ID_PERIPH_COUNT ( 30) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAMG51N18_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMG51N18 */
/* ************************************************************************** */
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ADC                    (0x40038000)                   /**< \brief (ADC       ) Base Address */
#define CHIPID                 (0x400E0740)                   /**< \brief (CHIPID    ) Base Address */
#define EFC                    (0x400E0A00)                   /**< \brief (EFC       ) Base Address */
#define GPBR                   (0x400E1490)                   /**< \brief (GPBR      ) Base Address */
#define MATRIX                 (0x400E0200)                   /**< \brief (MATRIX    ) Base Address */
#define MEM2MEM                (0x40028000)                   /**< \brief (MEM2MEM   ) Base Address */
#define PIOA                   (0x400E0E00)                   /**< \brief (PIOA      ) Base Address */
#define PIOB                   (0x400E1000)                   /**< \brief (PIOB      ) Base Address */
#define PMC                    (0x400E0400)                   /**< \brief (PMC       ) Base Address */
#define RSTC                   (0x400E1400)                   /**< \brief (RSTC      ) Base Address */
#define RTC                    (0x400E1460)                   /**< \brief (RTC       ) Base Address */
#define RTT                    (0x400E1430)                   /**< \brief (RTT       ) Base Address */
#define SPI                    (0x40008000)                   /**< \brief (SPI       ) Base Address */
#define SUPC                   (0x400E1410)                   /**< \brief (SUPC      ) Base Address */
#define TC0                    (0x40010000)                   /**< \brief (TC0       ) Base Address */
#define TWI1                   (0x4001C000)                   /**< \brief (TWI1      ) Base Address */
#define TWI2                   (0x40040000)                   /**< \brief (TWI2      ) Base Address */
#define TWI0                   (0x40018000)                   /**< \brief (TWI0      ) Base Address */
#define UART0                  (0x400E0600)                   /**< \brief (UART0     ) Base Address */
#define UART1                  (0x400E0800)                   /**< \brief (UART1     ) Base Address */
#define USART                  (0x40024000)                   /**< \brief (USART     ) Base Address */
#define WDT                    (0x400E1450)                   /**< \brief (WDT       ) Base Address */

#else /* For C/C++ compiler */

