MikroElektronika/core_packages/ARM/gcc_clang/def/sam/SAMG51N18A/mcu.h
#define ADC                    ((Adc *)0x40038000U)           /**< \brief (ADC       ) Base Address */
#define ADC_INST_NUM           1                              /**< \brief (ADC       ) Number of instances */
#define ADC_INSTS              { ADC }                        /**< \brief (ADC       ) Instances List */

#define CHIPID                 ((Chipid *)0x400E0740U)        /**< \brief (CHIPID    ) Base Address */
#define CHIPID_INST_NUM        1                              /**< \brief (CHIPID    ) Number of instances */
#define CHIPID_INSTS           { CHIPID }                     /**< \brief (CHIPID    ) Instances List */

#define EFC                    ((Efc *)0x400E0A00U)           /**< \brief (EFC       ) Base Address */
#define EFC_INST_NUM           1                              /**< \brief (EFC       ) Number of instances */
#define EFC_INSTS              { EFC }                        /**< \brief (EFC       ) Instances List */

#define GPBR                   ((Gpbr *)0x400E1490U)          /**< \brief (GPBR      ) Base Address */
#define GPBR_INST_NUM          1                              /**< \brief (GPBR      ) Number of instances */
#define GPBR_INSTS             { GPBR }                       /**< \brief (GPBR      ) Instances List */

#define MATRIX                 ((Matrix *)0x400E0200U)        /**< \brief (MATRIX    ) Base Address */
#define MATRIX_INST_NUM        1                              /**< \brief (MATRIX    ) Number of instances */
#define MATRIX_INSTS           { MATRIX }                     /**< \brief (MATRIX    ) Instances List */

#define MEM2MEM                ((Mem2mem *)0x40028000U)       /**< \brief (MEM2MEM   ) Base Address */
#define MEM2MEM_INST_NUM       1                              /**< \brief (MEM2MEM   ) Number of instances */
#define MEM2MEM_INSTS          { MEM2MEM }                    /**< \brief (MEM2MEM   ) Instances List */

#define PIOA                   ((Pio *)0x400E0E00U)           /**< \brief (PIOA      ) Base Address */
#define PIOB                   ((Pio *)0x400E1000U)           /**< \brief (PIOB      ) Base Address */
#define PIO_INST_NUM           2                              /**< \brief (PIO       ) Number of instances */
#define PIO_INSTS              { PIOA, PIOB }                 /**< \brief (PIO       ) Instances List */

#define PMC                    ((Pmc *)0x400E0400U)           /**< \brief (PMC       ) Base Address */
#define PMC_INST_NUM           1                              /**< \brief (PMC       ) Number of instances */
#define PMC_INSTS              { PMC }                        /**< \brief (PMC       ) Instances List */

#define RSTC                   ((Rstc *)0x400E1400U)          /**< \brief (RSTC      ) Base Address */
#define RSTC_INST_NUM          1                              /**< \brief (RSTC      ) Number of instances */
#define RSTC_INSTS             { RSTC }                       /**< \brief (RSTC      ) Instances List */

#define RTC                    ((Rtc *)0x400E1460U)           /**< \brief (RTC       ) Base Address */
#define RTC_INST_NUM           1                              /**< \brief (RTC       ) Number of instances */
#define RTC_INSTS              { RTC }                        /**< \brief (RTC       ) Instances List */

#define RTT                    ((Rtt *)0x400E1430U)           /**< \brief (RTT       ) Base Address */
#define RTT_INST_NUM           1                              /**< \brief (RTT       ) Number of instances */
#define RTT_INSTS              { RTT }                        /**< \brief (RTT       ) Instances List */

#define SPI                    ((Spi *)0x40008000U)           /**< \brief (SPI       ) Base Address */
#define SPI_INST_NUM           1                              /**< \brief (SPI       ) Number of instances */
#define SPI_INSTS              { SPI }                        /**< \brief (SPI       ) Instances List */

#define SUPC                   ((Supc *)0x400E1410U)          /**< \brief (SUPC      ) Base Address */
#define SUPC_INST_NUM          1                              /**< \brief (SUPC      ) Number of instances */
#define SUPC_INSTS             { SUPC }                       /**< \brief (SUPC      ) Instances List */

#define TC0                    ((Tc *)0x40010000U)            /**< \brief (TC0       ) Base Address */
#define TC_INST_NUM            1                              /**< \brief (TC        ) Number of instances */
#define TC_INSTS               { TC0 }                        /**< \brief (TC        ) Instances List */

#define TWI1                   ((Twi *)0x4001C000U)           /**< \brief (TWI1      ) Base Address */
#define TWI2                   ((Twi *)0x40040000U)           /**< \brief (TWI2      ) Base Address */
#define TWI_INST_NUM           2                              /**< \brief (TWI       ) Number of instances */
#define TWI_INSTS              { TWI1, TWI2 }                 /**< \brief (TWI       ) Instances List */

#define TWI0                   ((Twihs *)0x40018000U)         /**< \brief (TWI0      ) Base Address */
#define TWIHS_INST_NUM         1                              /**< \brief (TWIHS     ) Number of instances */
#define TWIHS_INSTS            { TWI0 }                       /**< \brief (TWIHS     ) Instances List */

#define UART0                  ((Uart *)0x400E0600U)          /**< \brief (UART0     ) Base Address */
#define UART1                  ((Uart *)0x400E0800U)          /**< \brief (UART1     ) Base Address */
#define UART_INST_NUM          2                              /**< \brief (UART      ) Number of instances */
#define UART_INSTS             { UART0, UART1 }               /**< \brief (UART      ) Instances List */

#define USART                  ((Usart *)0x40024000U)         /**< \brief (USART     ) Base Address */
#define USART_INST_NUM         1                              /**< \brief (USART     ) Number of instances */
#define USART_INSTS            { USART }                      /**< \brief (USART     ) Instances List */

